namespace MineUTF3_0
{
    class Holders
    {
        // Выбор в комбобоксе. Просто тут потому что тут
        public int CurrentIndexMode = 0;
        public int CurrentIndexLang = 0;

        public string Version = "MineUTF 3.3";
        public string Error = "Нет уж, не так.\nРазрешенные символы:\n";

        // Массив под BigLat
        public char[] OriginalCharacters_BigLat = { 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0' };
        public char[] ReplaceCharacters_BigLat = { 'Ａ', 'Ｂ', 'Ｃ', 'Ｄ', 'Ｅ', 'Ｆ', 'Ｇ', 'Ｈ', 'Ｉ', 'Ｊ', 'Ｋ', 'Ｌ', 'Ｍ', 'Ｎ', 'Ｏ', 'Ｐ', 'Ｑ', 'Ｒ', 'Ｓ', 'Ｔ', 'Ｕ', 'Ｖ', 'Ｗ', 'Ｘ', 'Ｙ', 'Ｚ', 'ａ', 'ｂ', 'ｃ', 'ｄ', 'ｅ', 'ｆ', 'ｇ', 'ｈ', 'ｉ', 'ｊ', 'ｋ', 'ｌ', 'ｍ', 'ｎ', 'ｏ', 'ｐ', 'ｑ', 'ｒ', 'ｓ', 'ｔ', 'ｕ', 'ｖ', 'ｗ', 'ｘ', 'ｙ', 'ｚ', '₁', '₂', '₃', '₄', '₅', '₆', '₇', '₈', '₉', '₀' };

        // Массив под BetterLat
        public char[] OriginalCharacters_BetterLat = { 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0' };
        public char[] ReplaceCharacters_BetterLat = { 'ᴀ', 'ʙ', 'ᴄ', 'ᴅ', 'ᴇ', 'ꜰ', 'ɢ', 'ʜ', 'ɪ', 'ᴊ', 'ᴋ', 'ʟ', 'ᴍ', 'ɴ', 'ᴏ', 'ᴘ', 'ǫ', 'ʀ', 'ꜱ', 'ᴛ', 'ᴜ', 'ᴠ', 'ᴡ', 'x', 'ʏ', 'ᴢ', '₁', '₂', '₃', '₄', '₅', '₆', '₇', '₈', '₉', '₀' };

        // Массив под Cyrillic
        public char[] OriginalCharacters_Cyrillic = { 'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0' };
        public char[] ReplaceCharacters_Cyrillic = { 'ᴀ', 'б', 'ʙ', 'ᴦ', 'д', 'ᴇ', 'ё', 'ж', 'з', 'и', 'й', 'ᴋ', 'э', 'ʍ', 'н', 'о', 'п', 'р', 'ᴄ', 'ᴛ', 'у', 'ɸ', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я', '₁', '₂', '₃', '₄', '₅', '₆', '₇', '₈', '₉', '₀' };

        // Массив под RoundedNum
        public char[] OriginalNum_RNum = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9' };
        public char[] ReplaceNum_RNum = { '⓪', '①', '②', '③', '④', '⑤', '⑥', '⑦', '⑧', '⑨' };
    }
}
